emsesp/EMS-ESP32/src/system.cpp
// save settings file using input from a json object
bool System::saveSettings(const char * filename, const char * section, JsonObject & input) {
#ifndef EMSESP_STANDALONE
    JsonObject section_json = input[section];
    if (section_json) {
        File section_file = LITTLEFS.open(filename, "w");
        if (section_file) {
            LOG_INFO(F("Applying new %s settings"), section);
            serializeJson(section_json, section_file);
            section_file.close();
            return true; // reboot required
        }
    }
#endif
    return false; // not found
}

// export all settings to JSON text
// we need to keep the original format so the import/upload works as we just replace files
// http://ems-esp/api/system/settings
bool System::command_settings(const char * value, const int8_t id, JsonObject & output) {
    output["type"] = "settings";

    JsonObject node = output.createNestedObject("System");
    node["version"] = EMSESP_APP_VERSION;

    extractSettings(NETWORK_SETTINGS_FILE, "Network", output);
    extractSettings(AP_SETTINGS_FILE, "AP", output);
    extractSettings(MQTT_SETTINGS_FILE, "MQTT", output);
    extractSettings(NTP_SETTINGS_FILE, "NTP", output);
    extractSettings(OTA_SETTINGS_FILE, "OTA", output);
    extractSettings(SECURITY_SETTINGS_FILE, "Security", output);
    extractSettings(EMSESP_SETTINGS_FILE, "Settings", output);

    return true;
}

// http://ems-esp/api/system/customizations
// we need to keep the original format so the import/upload works as we just replace file
bool System::command_customizations(const char * value, const int8_t id, JsonObject & output) {
    output["type"] = "customizations";
    extractSettings(EMSESP_CUSTOMIZATION_FILE, "Customizations", output);
    return true;
}

// export status information including the device information
// http://ems-esp/api/system/info
bool System::command_info(const char * value, const int8_t id, JsonObject & output) {
    JsonObject node;

    // System
    node = output.createNestedObject("System");

    node["version"]          = EMSESP_APP_VERSION;
    node["uptime"]           = uuid::log::format_timestamp_ms(uuid::get_uptime_ms(), 3);
    node["uptime (seconds)"] = uuid::get_uptime_sec();
    node["network time"]     = EMSESP::system_.ntp_connected() ? "connected" : "disconnected";

#ifndef EMSESP_STANDALONE
    node["freemem"] = ESP.getFreeHeap() / 1000L; // kilobytes
#endif
    node["reset reason"] = EMSESP::system_.reset_reason(0) + " / " + EMSESP::system_.reset_reason(1);

    if (EMSESP::dallas_enabled()) {
        node["temperature sensors"] = EMSESP::dallassensor_.no_sensors();
    }

    if (EMSESP::analog_enabled()) {
        node["analog sensors"] = EMSESP::analogsensor_.no_sensors();
    }

#ifndef EMSESP_STANDALONE
    // Network
    node = output.createNestedObject("Network");
    if (WiFi.status() == WL_CONNECTED) {
        node["connection"]      = F("WiFi");
        node["hostname"]        = WiFi.getHostname();
        node["SSID"]            = WiFi.SSID();
        node["BSSID"]           = WiFi.BSSIDstr();
        node["RSSI"]            = WiFi.RSSI();
        node["MAC"]             = WiFi.macAddress();
        node["IPv4 address"]    = uuid::printable_to_string(WiFi.localIP()) + "/" + uuid::printable_to_string(WiFi.subnetMask());
        node["IPv4 gateway"]    = uuid::printable_to_string(WiFi.gatewayIP());
        node["IPv4 nameserver"] = uuid::printable_to_string(WiFi.dnsIP());
        if (WiFi.localIPv6().toString() != "0000:0000:0000:0000:0000:0000:0000:0000") {
            node["IPv6 address"] = uuid::printable_to_string(WiFi.localIPv6());
        }
    } else if (EMSESP::system_.ethernet_connected()) {
        node["connection"]      = F("Ethernet");
        node["hostname"]        = ETH.getHostname();
        node["MAC"]             = ETH.macAddress();
        node["IPv4 address"]    = uuid::printable_to_string(ETH.localIP()) + "/" + uuid::printable_to_string(ETH.subnetMask());
        node["IPv4 gateway"]    = uuid::printable_to_string(ETH.gatewayIP());
        node["IPv4 nameserver"] = uuid::printable_to_string(ETH.dnsIP());
        if (ETH.localIPv6().toString() != "0000:0000:0000:0000:0000:0000:0000:0000") {
            node["IPv6 address"] = uuid::printable_to_string(ETH.localIPv6());
        }
    }
#endif

    // Status
    node = output.createNestedObject("Status");

    switch (EMSESP::bus_status()) {
    case EMSESP::BUS_STATUS_OFFLINE:
        node["bus status"] = (F("disconnected"));
        break;
    case EMSESP::BUS_STATUS_TX_ERRORS:
        node["bus status"] = (F("connected, tx issues - try a different tx-mode"));
        break;
    case EMSESP::BUS_STATUS_CONNECTED:
        node["bus status"] = (F("connected"));
        break;
    default:
        node["bus status"] = (F("unknown"));
        break;
    }

    if (EMSESP::bus_status() != EMSESP::BUS_STATUS_OFFLINE) {
        node["bus protocol"]                = EMSbus::is_ht3() ? F("HT3") : F("Buderus");
        node["bus telegrams received (rx)"] = EMSESP::rxservice_.telegram_count();
        node["bus reads (tx)"]              = EMSESP::txservice_.telegram_read_count();
        node["bus writes (tx)"]             = EMSESP::txservice_.telegram_write_count();
        node["bus incomplete telegrams"]    = EMSESP::rxservice_.telegram_error_count();
        node["bus reads failed"]            = EMSESP::txservice_.telegram_read_fail_count();
        node["bus writes failed"]           = EMSESP::txservice_.telegram_write_fail_count();
        node["bus rx line quality"]         = EMSESP::rxservice_.quality();
        node["bus tx line quality"]         = (EMSESP::txservice_.read_quality() + EMSESP::txservice_.read_quality()) / 2;
        if (Mqtt::enabled()) {
            node["MQTT status"]        = Mqtt::connected() ? F_(connected) : F_(disconnected);
            node["MQTT publishes"]     = Mqtt::publish_count();
            node["MQTT publish fails"] = Mqtt::publish_fails();
        }
        node["temperature sensors"] = EMSESP::dallassensor_.no_sensors();
        if (EMSESP::dallas_enabled()) {
            node["temperature sensor reads"] = EMSESP::dallassensor_.reads();
            node["temperature sensor fails"] = EMSESP::dallassensor_.fails();
        }
        node["analog sensors"] = EMSESP::analogsensor_.no_sensors();
        if (EMSESP::analog_enabled()) {
            node["analog sensor reads"] = EMSESP::analogsensor_.reads();
            node["analog sensor fails"] = EMSESP::analogsensor_.fails();
        }
        node["API calls"] = WebAPIService::api_count();
        node["API fails"] = WebAPIService::api_fails();

#ifndef EMSESP_STANDALONE
        if (EMSESP::system_.syslog_enabled_) {
            node["syslog started"] = syslog_.started();
            node["syslog level"]   = FL_(enum_syslog_level)[syslog_.log_level() + 1];
            node["syslog ip"]      = syslog_.ip();
            node["syslog queue"]   = syslog_.queued();
        }
#endif
    }

    // Devices - show EMS devices
    JsonArray devices = output.createNestedArray("Devices");
    for (const auto & device_class : EMSFactory::device_handlers()) {
        for (const auto & emsdevice : EMSESP::emsdevices) {
            if (emsdevice && (emsdevice->device_type() == device_class.first)) {
                JsonObject obj = devices.createNestedObject();
                obj["type"]    = emsdevice->device_type_name();
                // obj["name"]     = emsdevice->to_string();
                obj["name"]       = emsdevice->name();
                obj["device id"]  = Helpers::hextoa(emsdevice->device_id());
                obj["product id"] = emsdevice->product_id();
                obj["version"]    = emsdevice->version();
                obj["entities"]   = emsdevice->count_entities();
                char result[300];
                (void)emsdevice->show_telegram_handlers(result, sizeof(result), EMSdevice::Handlers::RECEIVED);
                if (result[0] != '\0') {
                    obj["handlers received"] = result; // don't show handlers if there aren't any
                }
                (void)emsdevice->show_telegram_handlers(result, sizeof(result), EMSdevice::Handlers::FETCHED);
                if (result[0] != '\0') {
                    obj["handlers fetched"] = result;
                }
                (void)emsdevice->show_telegram_handlers(result, sizeof(result), EMSdevice::Handlers::PENDING);
                if (result[0] != '\0') {
                    obj["handlers pending"] = result;
                }
                (void)emsdevice->show_telegram_handlers(result, sizeof(result), EMSdevice::Handlers::IGNORED);
                if (result[0] != '\0') {
                    obj["handlers ignored"] = result;
                }
            }
        }
    }

